import { query } from '../connect';
import * as T from '../../constants';

const createCommonI18n = async ({ commonId, languageCode, content }) => {
  const sql = `INSERT INTO common_i18n (
    common_id,
    language_code,
    content
  ) VALUES (
    $1,
    $2,
    $3
  ) RETURNING *`;
  const res = await query(sql, [commonId, languageCode, content]);
  return res.rows[0];
};

const addCommonI18n = async () => {
  const commonAR = await createCommonI18n({
    commonId: 1,
    languageCode: T.languageCodes.ARABIC,
    content: {
      words: {
        and: 'و',
      },
      colors: {
        0: {
          label: 'أزرق',
        },
        1: {
          label: 'أخضر',
        },
        2: {
          label: 'أصفر',
        },
        3: {
          label: 'أحمر',
        },
      },
      buttons: {
        goBack: 'ارجع',
        readMore: 'اقرأ المزيد',
        seeAdvice: 'انظر النصيحة',
        accessibility: 'إمكانية الوصول',
        decreaseTextSize: '- تقليل حجم النص',
        increaseTextSize: '+ زيادة حجم النص',
        stuckTalkToSomeOne: 'عالق؟ التحدث إلى شخص ما',
      },
      heading: {
        shareThisPage: 'شارك هذه الصفحة',
        helpfulResources: 'موارد مفيدة',
        costOfLivingHelper: 'مساعد تكلفة المعيشة',
      },
      section: {
        helpMe: {
          title: 'مساعدة!',
          govPhone: '0800 328 5644 (اختر الخيار 3)',
          subtitle: 'المساعدة هنا!',
          description:
            'نحتاج جميعًا إلى التحدث إلى شخص ما في بعض الأحيان! استخدم أيًا من تفاصيل الاتصال أدناه للعثور على شخص للدردشة معه.',
          govHelpline: 'خط المساعدة الحكومي',
          govOpeningTimes:
            'من الاثنين إلى الجمعة، من الساعة 8 صباحًا حتى 6 مساءً',
        },
        budgeting: {
          tip: 'نصيحة!',
          title: '**الميزانية**',
          tip1P1: 'عند القيام بميزانيتك، كن صادقًا ودقيقًا قدر الإمكان.',
          tip1P2:
            'ضع ما تنفقه بالفعل، على عكس ما تعتقد أنك يجب أن تنفقه أو يمكنك إنفاقه.',
          tip1P3:
            'من خلال إنشاء ميزانية دقيقة، تحصل على أفضل نقطة بداية ممكنة لتحقيق أقصى استفادة من أموالك، أو التحدث إلى الدائنين، أو الحصول على المال أو المشورة بشأن الديون.',
          tip2P1:
            'يتم تنفيذ معظم الميزانيات لمدة شهر تقويمي؛ ضع ذلك في الاعتبار عند إضافة دخلك ونفقاتك. على سبيل المثال، لحساب المبلغ الشهري لشيء تدفعه أسبوعيًا، ستحتاج إلى ضرب المبلغ في 52 (أسبوعًا)، ثم القسمة على 12 (شهرًا).',
          tip2P2: 'ستقوم أداة الميزانية بذلك نيابة عنك تلقائيًا.',
          tipTitle: 'فيما يلي أهم النصائح',
          description:
            'يعد إعداد ميزانية لمعرفة مقدار الأموال التي تحصل عليها وتخرجها مكانًا رائعًا للبدء. هناك العديد من أدوات الميزانية المتاحة لمساعدتك على القيام بذلك، ولكن مستشار الديون أو مستشار الأموال سيكون قادرًا على مساعدتك إذا وجدت صعوبة في القيام بذلك بنفسك.',
        },
        helpBudget: {
          title: 'هل تحتاج إلى مساعدة في إعداد الميزانية؟',
          description:
            'أنت تعرف مقدار الدخول والخروج ولكن إذا كنت بحاجة إلى المساعدة، فيمكننا مساعدتك في حل المشكلة.',
        },
        subSection: {
          description:
            'حتى نتمكن من عرض أفضل المعلومات، أي منها يصفك بشكل أفضل؟',
        },
        worriedAbout: {
          title: 'أنا قلقة بشأن...',
          description:
            'إذا كنت قلقًا بشأن المال، فهناك الكثير من المساعدة. قد تكون معرفة من أين تبدأ أمرًا صعبًا، ولكن في هذه الأداة ستجد نصائح ونصائح مفيدة حول ما يمكنك القيام به. يمكنك أيضًا وضع إشارة مرجعية على الإجراءات أثناء البحث.',
        },
        accessibility: {
          tip1: 'نصيحة! إذا واجهت أي مشكلة تتعلق بإمكانية الوصول على هذا الموقع أو لديك أي تعليق، يرجى',
          tip2: 'نصيحة! هناك العديد من ميزات إمكانية الوصول على الأجهزة، والتي يمكن العثور عليها في روابط مثل',
          title: 'إمكانية الوصول',
          contactUs: 'اتصل بنا',
          appleTitle: 'تفاحة',
          changeFont: 'تغيير الخط',
          forAndroid: 'للهواتف أو الأجهزة اللوحية التي تعمل بنظام Android',
          androidApps: 'تطبيقات أندرويد',
          chromeTitle: 'كروم',
          googleSpeak: 'انقر هنا لتنزيل غوغل سبيك',
          textSizetip:
            'نصيحة! انقر فوق زيادة حجم النص بنسبة 25٪ (على سبيل المثال من 16 بكسل إلى 20 بكسل)',
          description1:
            'تسترشد إمكانية الوصول على هذا الموقع بالمعايير الحكومية وإرشادات الوصول إلى محتوى الويب WCAG مقبولة على نطاق واسع كمعيار دولي لإمكانية الوصول على الويب.',
          description2:
            'بينما نهدف إلى جعل هذا الموقع متاحًا لجميع المستخدمين وتحقيق مستوى التوافق «AAA»، فإننا نعمل باستمرار مع أصحاب المصلحة لضمان الالتزام بمستوى المطابقة «A» كحد أدنى.',
          firefoxTitle: 'فيرفكس',
          addSpeakButton: 'وحدد زر الإضافة إلى Chrome',
          adjustTextSize: 'ضبط حجم النص',
          windowsEdgeTitle: 'ويندوز إيدج',
          downloadReadAloud: 'انقر هنا لتنزيل برنامج Read Aloud',
          textToSpeechTitle: 'تحويل النص إلى كلام',
          appleAccessibility: 'ميزات إمكانية الوصول من Apple',
          downloadVoiceAloud:
            'انقر هنا لتنزيل قارئ الصوت بصوت عالٍ لأجهزة Apple.',
          firefoxDescription:
            'انتقل إلى «عرض» على شريط القائمة - حدد حجم النص/التكبير. بدلاً من ذلك، استمر في الضغط على زر «Ctrl» على لوحة المفاتيح واضغط على مفتاح الجمع (+) لزيادة حجم النص. لتقليل هذا الأخير، استمر في الضغط على زر «Ctrl» واضغط على مفتاح الطرح (-). يرجى ملاحظة أن الإعدادات المذكورة أعلاه قد تختلف اعتمادًا على إصدار المتصفح.',
          androidAccessibility: 'إمكانية الوصول إلى Android',
          internetExplorerTitle: 'إنترنيت إكسبلورر',
          searchVoiceAloudReader:
            'اختر جهازك عند التنزيل. أو انتقل إلى متجر تطبيقات Apple الخاص بك وابحث عن برنامج Voice Aloud Reader',
          windowsEdgeDescription:
            'افتح متصفح Edge ثم انقر فوق خيار القراءة بصوت عالٍ أو على لوحة المفاتيح اضغط على Ctrl+Shift + U',
          textToSpeechDescription:
            'تحتوي العديد من أجهزة الكمبيوتر والأجهزة المحمولة اليوم على برنامج تحويل النص إلى كلام. فيما يلي أدلة لكل من المتصفحات والأجهزة الرئيسية:',
          internetExplorerDescription:
            'انتقل إلى «عرض» على شريط القائمة - حدد حجم النص/التكبير',
        },
        stillNeedHelp: {
          title: 'لا تزال بحاجة إلى مساعدة؟',
          subtitle: 'إذا كنت ترغب في التحدث إلى شخص ما، اتصل ',
        },
        changeLanguage: {
          title: 'تغيير اللغة',
          placeholder: 'ابحث',
        },
        mentalHealthSupport: {
          title: '**دعم الصحة النفسية**',
          description1:
            'يمكن أن يؤثر القلق بشأن المال على صحتك العقلية. يعد اتخاذ إجراء، مثل استخدام هذه الأداة، خطوة أولى جيدة. ومع ذلك، إذا كنت تشعر بالإرهاق، فإن الدعم موجود. يشعر الكثير من الناس بنفس الطريقة.',
          description2:
            ' إذا كنت تشعر أنك بحاجة إلى التحدث إلى شخص ما الآن، فإن Samaritans تقدم خدمة استماع سرية مجانية على مدار 24 ساعة. يمكنك التحدث معهم عن أي شيء يزعجك أو يقلقك.',
          samaritansHours: '(من الاثنين إلى الأحد في أي وقت)',
          samaritansHelpline: 'خط مساعدة السامريين:',
        },
        stressedOrOverwhelmed: {
          title: 'الشعور بالتوتر أو الإرهاق',
        },
      },
    },
  });

  return {
    commonAR,
  };
};

export default addCommonI18n;
